//arrar & array method

//১. Array (অ্যারে) কী?
//অ্যারে হলো একটি ডাটা স্ট্রাকচার বা ডেটা রাখার পাত্র (Container)। যেখানে একাধিক ভ্যালু বা তথ্য পরপর সাজিয়ে এক জায়গায় রাখা যায়।

//সংজ্ঞা: ডেটার সংকলন বা লিস্ট।

//উদাহরণ:JavaScript
const numbers = [10, 20, 30, 40]; // এটি একটি Array



//২. Array Method (অ্যারে মেথড) কী?
//অ্যারে মেথড হলো কিছু বিল্ট-ইন ফাংশন (Built-in Functions) যা ওই অ্যারের ভেতর জমা থাকা ডাটাগুলোকে প্রসেস করার জন্য তৈরি করা হয়েছে।
//এগুলো Array Method (অ্যারে মেথড), সরাসরি Array বা অ্যারে নিজে নয়। 

//সংজ্ঞা: অ্যারের ডাটা ম্যানিপুলেট বা প্রসেস করার হাতিয়ার বা টুলস।

//উদাহরণ:JavaScript
// map(), filter(), reduce() ইত্যাদি হলো Array Methods
numbers.map(num => num * 2); // output : [ 20, 40, 60, 80 ]
//সহজ এনালজি (Analogy) Array: একটি বক্স বা ঝুড়ি (যার ভেতর কিছু ফল রাখা আছে)।

//Array Method: ফলগুলো কাটার ছুরি, জুস বানানোর ব্লেন্ডার, বা ভালো ফল বাছাই করার চালনি।

//অর্থাৎ, Array হলো ডাটা নিজে, আর Array Method হলো ডাটা প্রসেস করার বিল্ট-ইন টুলস।









//Array vs Object: অ্যারেতে ডাটা ইনডেক্স (0, 1, 2) অনুযায়ী থাকে, আর অবজেক্টে নামযুক্ত কী (key) দিয়ে ডাটা নির্দিষ্ট করা হয়।
// একটি ইউজার অবজেক্ট
const user = {
  id: 101,
  name: "Rahim",
  role: "admin",
  isVerified: true
};

console.log(user.name); 
// output : Rahim





//Object Methods
//অবজেক্টের ভেতর থেকে ডাটা সহজে বের করা, ফিল্টার করা বা লুপ চালানোর জন্য জাভাস্ক্রিপ্
//টেObject.keys(), Object.values() এবং Object.entries() মেথডগুলো ব্যবহার করা হয়।